Exploratory data analysis for the movie lens 20 million rating dataset. Practice with Ipython notebook and python data analysis libraries.

In [1]:
# Import libraries 
%matplotlib inline
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
from math import sqrt, pi 
import sys

In [4]:
# Print the versions 
print 'Python version: ' + sys.version
print 'Pandas version: ' + pd.__version__
print 'Numpy version:' + np.__version__

Python version: 2.7.13 |Continuum Analytics, Inc.| (default, Dec 20 2016, 23:05:08)
[GCC 4.2.1 Compatible Apple LLVM 6.0 (clang-600.0.57)]
Pandas version: 0.20.1
Numpy version:1.11.2

In [10]:
genomeScoresLoc = '../datasets/20m/ml-20m/ml-20m/genome-scores.csv'
genomeTagsLoc = '../datasets/20m/ml-20m/ml-20m/genome-tags.csv'
linksLoc = '../datasets/20m/ml-20m/ml-20m/links.csv'
moviesLoc = '../datasets/20m/ml-20m/ml-20m/movies.csv'
ratingLoc = '../datasets/20m/ml-20m/ml-20m/ratings.csv'
tagsLoc = '../datasets/20m/ml-20m/ml-20m/tags.csv'

In [12]:
gs = pd.read_csv(genomeScoresLoc)

In [14]:
gs.shape

(11709768, 3)

In [16]:
gs.head(3)

   movieId  tagId  relevance
0        1      1    0.02500
1        1      2    0.02500
2        1      3    0.05775

In [17]:
gt = pd.read_csv(genomeTagsLoc)

In [19]:
gt.shape

(1128, 2)

In [23]:
gt.head(5)

   tagId           tag
0      1           007
1      2  007 (series)
2      3  18th century
3      4         1920s
4      5         1930s

In [26]:
links = pd.read_csv(linksLoc)

In [27]:
links.shape

(27278, 3)

In [28]:
links.head(5)

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [29]:
movies = pd.read_csv(moviesLoc)

In [31]:
movies.shape

(27278, 3)

In [32]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [33]:
rating = pd.read_csv(ratingLoc)

In [34]:
rating.shape

(20000263, 4)

In [35]:
rating.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [41]:
rating.tail()

          userId  movieId  rating   timestamp
20000258  138493    68954     4.5  1258126920
20000259  138493    69526     4.5  1259865108
20000260  138493    69644     3.0  1260209457
20000261  138493    70286     5.0  1258126944
20000262  138493    71619     2.5  1255811136

In [39]:
rating.dtypes

userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object

In [40]:
rating.count()

userId       20000263
movieId      20000263
rating       20000263
timestamp    20000263
dtype: int64

In [36]:
tags = pd.read_csv(tagsLoc)

In [37]:
tags.shape

(465564, 4)

In [38]:
tags.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078